## Central account
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                     |
|--------|------------------------------------------------------------------------------|
| add    | `module.gh_oidc_roles.aws_iam_role.this[&quot;ConfigTerraformAdministratorRole&quot;]` |
| delete | `module.gh_oidc_roles.aws_iam_role.this[0]`                                  |
| update | `module.log_archive_bucket.aws_s3_bucket.this`                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.gh_oidc_roles.aws_iam_role.this[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::871282759583:role/ConfigTerraformAdministratorRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - token.actions.githubusercontent.com:sub = "repo:cds-snc/cloud-based-sensor:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::871282759583:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-01-27T20:51:10Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ConfigTerraformAdministratorRole" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ConfigTerraformAdministratorRole" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "CostCentre" = "cbs-871282759583"
          - "Terraform"  = "true"
        } -> null
      - tags_all              = {
          - "CostCentre" = "cbs-871282759583"
          - "Terraform"  = "true"
        } -> null
      - unique_id             = "AROA4VXD726PQKTOQQPXG" -> null

      - inline_policy {}
    }

  # module.gh_oidc_roles.aws_iam_role.this["ConfigTerraformAdministratorRole"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + token.actions.githubusercontent.com:sub = "repo:cds-snc/cloud-based-sensor:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::871282759583:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ConfigTerraformAdministratorRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cbs-871282759583"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.log_archive_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cbs-log-archive-871282759583"
        tags                        = {
            "CostCentre" = "cbs-871282759583"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)



      ~ logging {
          + target_prefix = "logs/"
            # (1 unchanged attribute hidden)
        }



        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.log_archive_access_bucket.aws_s3_bucket.this,
  on .terraform/modules/log_archive_access_bucket/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 6 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cbs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.event_bus_invoke_remote_event_bus"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.event_bus_invoke_remote_event_bus"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.log_archive_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.log_archive_encrypt"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.log_archive"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
